apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_flexio.h
/****************************************************************************
 * arch/arm/src/s32k3xx/hardware/s32k3xx_flexio.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/* Copyright 2022 NXP */

#ifndef __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_FLEXIO_H
#define __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_FLEXIO_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <hardware/s32k3xx_memorymap.h>

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* FlexIO Register Offsets **************************************************/

#define S32K3XX_FLEXIO_VERID_OFFSET          (0x0000) /* Version ID Register (VERID) */
#define S32K3XX_FLEXIO_PARAM_OFFSET          (0x0004) /* Parameter Register (PARAM) */
#define S32K3XX_FLEXIO_CTRL_OFFSET           (0x0008) /* FlexIO Control Register (CTRL) */
#define S32K3XX_FLEXIO_PIN_OFFSET            (0x000c) /* Pin State Register (PIN) */
#define S32K3XX_FLEXIO_SHIFTSTAT_OFFSET      (0x0010) /* Shifter Status Register (SHIFTSTAT) */
#define S32K3XX_FLEXIO_SHIFTERR_OFFSET       (0x0014) /* Shifter Error Register (SHIFTERR) */
#define S32K3XX_FLEXIO_TIMSTAT_OFFSET        (0x0018) /* Timer Status Register (TIMSTAT) */
#define S32K3XX_FLEXIO_SHIFTSIEN_OFFSET      (0x0020) /* Shifter Status Interrupt Enable (SHIFTSIEN) */
#define S32K3XX_FLEXIO_SHIFTEIEN_OFFSET      (0x0024) /* Shifter Error Interrupt Enable (SHIFTEIEN) */
#define S32K3XX_FLEXIO_TIMIEN_OFFSET         (0x0028) /* Timer Interrupt Enable Register (TIMIEN) */
#define S32K3XX_FLEXIO_SHIFTSDEN_OFFSET      (0x0030) /* Shifter Status DMA Enable (SHIFTSDEN) */
#define S32K3XX_FLEXIO_TIMERSDEN_OFFSET      (0x0038) /* Timer Status DMA Enable (TIMERSDEN) */
#define S32K3XX_FLEXIO_SHIFTSTATE_OFFSET     (0x0040) /* Shifter State Register (SHIFTSTATE) */
#define S32K3XX_FLEXIO_TRGSTAT_OFFSET        (0x0048) /* Trigger Status Register (TRGSTAT) */
#define S32K3XX_FLEXIO_TRIGIEN_OFFSET        (0x004c) /* External Trigger Interrupt Enable Register (TRIGIEN) */
#define S32K3XX_FLEXIO_PINSTAT_OFFSET        (0x0050) /* Pin Status Register (PINSTAT) */
#define S32K3XX_FLEXIO_PINIEN_OFFSET         (0x0054) /* Pin Interrupt Enable Register (PINIEN) */
#define S32K3XX_FLEXIO_PINREN_OFFSET         (0x0058) /* Pin Rising Edge Enable Register (PINREN) */
#define S32K3XX_FLEXIO_PINFEN_OFFSET         (0x005c) /* Pin Falling Edge Enable Register (PINFEN) */
#define S32K3XX_FLEXIO_PINOUTD_OFFSET        (0x0060) /* Pin Output Data Register (PINOUTD) */
#define S32K3XX_FLEXIO_PINOUTE_OFFSET        (0x0064) /* Pin Output Enable Register (PINOUTE) */
#define S32K3XX_FLEXIO_PINOUTDIS_OFFSET      (0x0068) /* Pin Output Disable Register (PINOUTDIS) */
#define S32K3XX_FLEXIO_PINOUTCLR_OFFSET      (0x006c) /* Pin Output Clear Register (PINOUTCLR) */
#define S32K3XX_FLEXIO_PINOUTSET_OFFSET      (0x0070) /* Pin Output Set Register (PINOUTSET) */
#define S32K3XX_FLEXIO_PINOUTTOG_OFFSET      (0x0074) /* Pin Output Toggle Register (PINOUTTOG) */
#define S32K3XX_FLEXIO_SHIFTCTL0_OFFSET      (0x0080) /* Shifter Control 0 Register (SHIFTCTL0) */
#define S32K3XX_FLEXIO_SHIFTCTL1_OFFSET      (0x0084) /* Shifter Control 1 Register (SHIFTCTL1) */
#define S32K3XX_FLEXIO_SHIFTCTL2_OFFSET      (0x0088) /* Shifter Control 2 Register (SHIFTCTL2) */
#define S32K3XX_FLEXIO_SHIFTCTL3_OFFSET      (0x008c) /* Shifter Control 3 Register (SHIFTCTL3) */
#define S32K3XX_FLEXIO_SHIFTCTL4_OFFSET      (0x0090) /* Shifter Control 4 Register (SHIFTCTL4) */
#define S32K3XX_FLEXIO_SHIFTCTL5_OFFSET      (0x0094) /* Shifter Control 5 Register (SHIFTCTL5) */
#define S32K3XX_FLEXIO_SHIFTCTL6_OFFSET      (0x0098) /* Shifter Control 6 Register (SHIFTCTL6) */
#define S32K3XX_FLEXIO_SHIFTCTL7_OFFSET      (0x009c) /* Shifter Control 7 Register (SHIFTCTL7) */
#define S32K3XX_FLEXIO_SHIFTCFG0_OFFSET      (0x0100) /* Shifter Configuration 0 Register (SHIFTCFG0) */
#define S32K3XX_FLEXIO_SHIFTCFG1_OFFSET      (0x0104) /* Shifter Configuration 1 Register (SHIFTCFG1) */
#define S32K3XX_FLEXIO_SHIFTCFG2_OFFSET      (0x0108) /* Shifter Configuration 2 Register (SHIFTCFG2) */
#define S32K3XX_FLEXIO_SHIFTCFG3_OFFSET      (0x010c) /* Shifter Configuration 3 Register (SHIFTCFG3) */
#define S32K3XX_FLEXIO_SHIFTCFG4_OFFSET      (0x0110) /* Shifter Configuration 4 Register (SHIFTCFG4) */
#define S32K3XX_FLEXIO_SHIFTCFG5_OFFSET      (0x0114) /* Shifter Configuration 5 Register (SHIFTCFG5) */
#define S32K3XX_FLEXIO_SHIFTCFG6_OFFSET      (0x0118) /* Shifter Configuration 6 Register (SHIFTCFG6) */
#define S32K3XX_FLEXIO_SHIFTCFG7_OFFSET      (0x011c) /* Shifter Configuration 7 Register (SHIFTCFG7) */
#define S32K3XX_FLEXIO_SHIFTBUF0_OFFSET      (0x0200) /* Shifter Buffer 0 Register (SHIFTBUF0) */
#define S32K3XX_FLEXIO_SHIFTBUF1_OFFSET      (0x0204) /* Shifter Buffer 1 Register (SHIFTBUF1) */
#define S32K3XX_FLEXIO_SHIFTBUF2_OFFSET      (0x0208) /* Shifter Buffer 2 Register (SHIFTBUF2) */
#define S32K3XX_FLEXIO_SHIFTBUF3_OFFSET      (0x020c) /* Shifter Buffer 3 Register (SHIFTBUF3) */
#define S32K3XX_FLEXIO_SHIFTBUF4_OFFSET      (0x0210) /* Shifter Buffer 4 Register (SHIFTBUF4) */
#define S32K3XX_FLEXIO_SHIFTBUF5_OFFSET      (0x0214) /* Shifter Buffer 5 Register (SHIFTBUF5) */
#define S32K3XX_FLEXIO_SHIFTBUF6_OFFSET      (0x0218) /* Shifter Buffer 6 Register (SHIFTBUF6) */
#define S32K3XX_FLEXIO_SHIFTBUF7_OFFSET      (0x021c) /* Shifter Buffer 7 Register (SHIFTBUF7) */
#define S32K3XX_FLEXIO_SHIFTBUFBIS0_OFFSET   (0x0280) /* Shifter Buffer 0 Bit Swapped Register (SHIFTBUFBIS0) */
#define S32K3XX_FLEXIO_SHIFTBUFBIS1_OFFSET   (0x0284) /* Shifter Buffer 1 Bit Swapped Register (SHIFTBUFBIS1) */
#define S32K3XX_FLEXIO_SHIFTBUFBIS2_OFFSET   (0x0288) /* Shifter Buffer 2 Bit Swapped Register (SHIFTBUFBIS2) */
#define S32K3XX_FLEXIO_SHIFTBUFBIS3_OFFSET   (0x028c) /* Shifter Buffer 3 Bit Swapped Register (SHIFTBUFBIS3) */
#define S32K3XX_FLEXIO_SHIFTBUFBIS4_OFFSET   (0x0290) /* Shifter Buffer 4 Bit Swapped Register (SHIFTBUFBIS4) */
#define S32K3XX_FLEXIO_SHIFTBUFBIS5_OFFSET   (0x0294) /* Shifter Buffer 5 Bit Swapped Register (SHIFTBUFBIS5) */
#define S32K3XX_FLEXIO_SHIFTBUFBIS6_OFFSET   (0x0298) /* Shifter Buffer 6 Bit Swapped Register (SHIFTBUFBIS6) */
#define S32K3XX_FLEXIO_SHIFTBUFBIS7_OFFSET   (0x029c) /* Shifter Buffer 7 Bit Swapped Register (SHIFTBUFBIS7) */
#define S32K3XX_FLEXIO_SHIFTBUFBYS0_OFFSET   (0x0300) /* Shifter Buffer 0 Byte Swapped Register (SHIFTBUFBYS0) */
#define S32K3XX_FLEXIO_SHIFTBUFBYS1_OFFSET   (0x0304) /* Shifter Buffer 1 Byte Swapped Register (SHIFTBUFBYS1) */
#define S32K3XX_FLEXIO_SHIFTBUFBYS2_OFFSET   (0x0308) /* Shifter Buffer 2 Byte Swapped Register (SHIFTBUFBYS2) */
#define S32K3XX_FLEXIO_SHIFTBUFBYS3_OFFSET   (0x030c) /* Shifter Buffer 3 Byte Swapped Register (SHIFTBUFBYS3) */
#define S32K3XX_FLEXIO_SHIFTBUFBYS4_OFFSET   (0x0310) /* Shifter Buffer 4 Byte Swapped Register (SHIFTBUFBYS4) */
#define S32K3XX_FLEXIO_SHIFTBUFBYS5_OFFSET   (0x0314) /* Shifter Buffer 5 Byte Swapped Register (SHIFTBUFBYS5) */
#define S32K3XX_FLEXIO_SHIFTBUFBYS6_OFFSET   (0x0318) /* Shifter Buffer 6 Byte Swapped Register (SHIFTBUFBYS6) */
#define S32K3XX_FLEXIO_SHIFTBUFBYS7_OFFSET   (0x031c) /* Shifter Buffer 7 Byte Swapped Register (SHIFTBUFBYS7) */
#define S32K3XX_FLEXIO_SHIFTBUFBBS0_OFFSET   (0x0380) /* Shifter Buffer 0 Bit Byte Swapped Register (SHIFTBUFBBS0) */
#define S32K3XX_FLEXIO_SHIFTBUFBBS1_OFFSET   (0x0384) /* Shifter Buffer 1 Bit Byte Swapped Register (SHIFTBUFBBS1) */
#define S32K3XX_FLEXIO_SHIFTBUFBBS2_OFFSET   (0x0388) /* Shifter Buffer 2 Bit Byte Swapped Register (SHIFTBUFBBS2) */
#define S32K3XX_FLEXIO_SHIFTBUFBBS3_OFFSET   (0x038c) /* Shifter Buffer 3 Bit Byte Swapped Register (SHIFTBUFBBS3) */
#define S32K3XX_FLEXIO_SHIFTBUFBBS4_OFFSET   (0x0390) /* Shifter Buffer 4 Bit Byte Swapped Register (SHIFTBUFBBS4) */
#define S32K3XX_FLEXIO_SHIFTBUFBBS5_OFFSET   (0x0394) /* Shifter Buffer 5 Bit Byte Swapped Register (SHIFTBUFBBS5) */
#define S32K3XX_FLEXIO_SHIFTBUFBBS6_OFFSET   (0x0398) /* Shifter Buffer 6 Bit Byte Swapped Register (SHIFTBUFBBS6) */
#define S32K3XX_FLEXIO_SHIFTBUFBBS7_OFFSET   (0x039c) /* Shifter Buffer 7 Bit Byte Swapped Register (SHIFTBUFBBS7) */
#define S32K3XX_FLEXIO_TIMCTL0_OFFSET        (0x0400) /* Timer Control 0 Register (TIMCTL0) */
#define S32K3XX_FLEXIO_TIMCTL1_OFFSET        (0x0404) /* Timer Control 1 Register (TIMCTL1) */
#define S32K3XX_FLEXIO_TIMCTL2_OFFSET        (0x0408) /* Timer Control 2 Register (TIMCTL2) */
#define S32K3XX_FLEXIO_TIMCTL3_OFFSET        (0x040c) /* Timer Control 3 Register (TIMCTL3) */
#define S32K3XX_FLEXIO_TIMCTL4_OFFSET        (0x0410) /* Timer Control 4 Register (TIMCTL4) */
#define S32K3XX_FLEXIO_TIMCTL5_OFFSET        (0x0414) /* Timer Control 5 Register (TIMCTL5) */
#define S32K3XX_FLEXIO_TIMCTL6_OFFSET        (0x0418) /* Timer Control 6 Register (TIMCTL6) */
#define S32K3XX_FLEXIO_TIMCTL7_OFFSET        (0x041c) /* Timer Control 7 Register (TIMCTL7) */
#define S32K3XX_FLEXIO_TIMCFG0_OFFSET        (0x0480) /* Timer Configuration 0 Register (TIMCFG0) */
#define S32K3XX_FLEXIO_TIMCFG1_OFFSET        (0x0484) /* Timer Configuration 1 Register (TIMCFG1) */
#define S32K3XX_FLEXIO_TIMCFG2_OFFSET        (0x0488) /* Timer Configuration 2 Register (TIMCFG2) */
#define S32K3XX_FLEXIO_TIMCFG3_OFFSET        (0x048c) /* Timer Configuration 3 Register (TIMCFG3) */
#define S32K3XX_FLEXIO_TIMCFG4_OFFSET        (0x0490) /* Timer Configuration 4 Register (TIMCFG4) */
#define S32K3XX_FLEXIO_TIMCFG5_OFFSET        (0x0494) /* Timer Configuration 5 Register (TIMCFG5) */
#define S32K3XX_FLEXIO_TIMCFG6_OFFSET        (0x0498) /* Timer Configuration 6 Register (TIMCFG6) */
#define S32K3XX_FLEXIO_TIMCFG7_OFFSET        (0x049c) /* Timer Configuration 7 Register (TIMCFG7) */
#define S32K3XX_FLEXIO_TIMCMP0_OFFSET        (0x0500) /* Timer Compare 0 Register (TIMCMP0) */
#define S32K3XX_FLEXIO_TIMCMP1_OFFSET        (0x0504) /* Timer Compare 1 Register (TIMCMP1) */
#define S32K3XX_FLEXIO_TIMCMP2_OFFSET        (0x0508) /* Timer Compare 2 Register (TIMCMP2) */
#define S32K3XX_FLEXIO_TIMCMP3_OFFSET        (0x050c) /* Timer Compare 3 Register (TIMCMP3) */
#define S32K3XX_FLEXIO_TIMCMP4_OFFSET        (0x0510) /* Timer Compare 4 Register (TIMCMP4) */
#define S32K3XX_FLEXIO_TIMCMP5_OFFSET        (0x0514) /* Timer Compare 5 Register (TIMCMP5) */
#define S32K3XX_FLEXIO_TIMCMP6_OFFSET        (0x0518) /* Timer Compare 6 Register (TIMCMP6) */
#define S32K3XX_FLEXIO_TIMCMP7_OFFSET        (0x051c) /* Timer Compare 7 Register (TIMCMP7) */
#define S32K3XX_FLEXIO_SHIFTBUFNBS0_OFFSET   (0x0680) /* Shifter Buffer 0 Nibble Byte Swapped Register (SHIFTBUFNBS0) */
#define S32K3XX_FLEXIO_SHIFTBUFNBS1_OFFSET   (0x0684) /* Shifter Buffer 1 Nibble Byte Swapped Register (SHIFTBUFNBS1) */
#define S32K3XX_FLEXIO_SHIFTBUFNBS2_OFFSET   (0x0688) /* Shifter Buffer 2 Nibble Byte Swapped Register (SHIFTBUFNBS2) */
#define S32K3XX_FLEXIO_SHIFTBUFNBS3_OFFSET   (0x068c) /* Shifter Buffer 3 Nibble Byte Swapped Register (SHIFTBUFNBS3) */
#define S32K3XX_FLEXIO_SHIFTBUFNBS4_OFFSET   (0x0690) /* Shifter Buffer 4 Nibble Byte Swapped Register (SHIFTBUFNBS4) */
#define S32K3XX_FLEXIO_SHIFTBUFNBS5_OFFSET   (0x0694) /* Shifter Buffer 5 Nibble Byte Swapped Register (SHIFTBUFNBS5) */
#define S32K3XX_FLEXIO_SHIFTBUFNBS6_OFFSET   (0x0698) /* Shifter Buffer 6 Nibble Byte Swapped Register (SHIFTBUFNBS6) */
#define S32K3XX_FLEXIO_SHIFTBUFNBS7_OFFSET   (0x069c) /* Shifter Buffer 7 Nibble Byte Swapped Register (SHIFTBUFNBS7) */
#define S32K3XX_FLEXIO_SHIFTBUFHWS0_OFFSET   (0x0700) /* Shifter Buffer 0 Half Word Swapped Register (SHIFTBUFHWS0) */
#define S32K3XX_FLEXIO_SHIFTBUFHWS1_OFFSET   (0x0704) /* Shifter Buffer 1 Half Word Swapped Register (SHIFTBUFHWS1) */
#define S32K3XX_FLEXIO_SHIFTBUFHWS2_OFFSET   (0x0708) /* Shifter Buffer 2 Half Word Swapped Register (SHIFTBUFHWS2) */
#define S32K3XX_FLEXIO_SHIFTBUFHWS3_OFFSET   (0x071c) /* Shifter Buffer 3 Half Word Swapped Register (SHIFTBUFHWS3) */
#define S32K3XX_FLEXIO_SHIFTBUFHWS4_OFFSET   (0x0710) /* Shifter Buffer 4 Half Word Swapped Register (SHIFTBUFHWS4) */
#define S32K3XX_FLEXIO_SHIFTBUFHWS5_OFFSET   (0x0714) /* Shifter Buffer 5 Half Word Swapped Register (SHIFTBUFHWS5) */
#define S32K3XX_FLEXIO_SHIFTBUFHWS6_OFFSET   (0x0718) /* Shifter Buffer 6 Half Word Swapped Register (SHIFTBUFHWS6) */
#define S32K3XX_FLEXIO_SHIFTBUFHWS7_OFFSET   (0x071c) /* Shifter Buffer 7 Half Word Swapped Register (SHIFTBUFHWS7) */
#define S32K3XX_FLEXIO_SHIFTBUFNIS0_OFFSET   (0x0780) /* Shifter Buffer 0 Nibble Swapped Register (SHIFTBUFNIS0) */
#define S32K3XX_FLEXIO_SHIFTBUFNIS1_OFFSET   (0x0784) /* Shifter Buffer 1 Nibble Swapped Register (SHIFTBUFNIS1) */
#define S32K3XX_FLEXIO_SHIFTBUFNIS2_OFFSET   (0x0788) /* Shifter Buffer 2 Nibble Swapped Register (SHIFTBUFNIS2) */
#define S32K3XX_FLEXIO_SHIFTBUFNIS3_OFFSET   (0x078c) /* Shifter Buffer 3 Nibble Swapped Register (SHIFTBUFNIS3) */
#define S32K3XX_FLEXIO_SHIFTBUFNIS4_OFFSET   (0x0790) /* Shifter Buffer 4 Nibble Swapped Register (SHIFTBUFNIS4) */
#define S32K3XX_FLEXIO_SHIFTBUFNIS5_OFFSET   (0x0794) /* Shifter Buffer 5 Nibble Swapped Register (SHIFTBUFNIS5) */
#define S32K3XX_FLEXIO_SHIFTBUFNIS6_OFFSET   (0x0798) /* Shifter Buffer 6 Nibble Swapped Register (SHIFTBUFNIS6) */
#define S32K3XX_FLEXIO_SHIFTBUFNIS7_OFFSET   (0x079c) /* Shifter Buffer 7 Nibble Swapped Register (SHIFTBUFNIS7) */
#define S32K3XX_FLEXIO_SHIFTBUFOES0_OFFSET   (0x0800) /* Shifter Buffer 0 Odd Even Swapped Register (SHIFTBUFOES0) */
#define S32K3XX_FLEXIO_SHIFTBUFOES1_OFFSET   (0x0804) /* Shifter Buffer 1 Odd Even Swapped Register (SHIFTBUFOES1) */
#define S32K3XX_FLEXIO_SHIFTBUFOES2_OFFSET   (0x0808) /* Shifter Buffer 2 Odd Even Swapped Register (SHIFTBUFOES2) */
#define S32K3XX_FLEXIO_SHIFTBUFOES3_OFFSET   (0x080c) /* Shifter Buffer 3 Odd Even Swapped Register (SHIFTBUFOES3) */
#define S32K3XX_FLEXIO_SHIFTBUFOES4_OFFSET   (0x0810) /* Shifter Buffer 4 Odd Even Swapped Register (SHIFTBUFOES4) */
#define S32K3XX_FLEXIO_SHIFTBUFOES5_OFFSET   (0x0814) /* Shifter Buffer 5 Odd Even Swapped Register (SHIFTBUFOES5) */
#define S32K3XX_FLEXIO_SHIFTBUFOES6_OFFSET   (0x0818) /* Shifter Buffer 6 Odd Even Swapped Register (SHIFTBUFOES6) */
#define S32K3XX_FLEXIO_SHIFTBUFOES7_OFFSET   (0x081c) /* Shifter Buffer 7 Odd Even Swapped Register (SHIFTBUFOES7) */
#define S32K3XX_FLEXIO_SHIFTBUFEOS0_OFFSET   (0x0880) /* Shifter Buffer 0 Even Odd Swapped Register (SHIFTBUFEOS0) */
#define S32K3XX_FLEXIO_SHIFTBUFEOS1_OFFSET   (0x0884) /* Shifter Buffer 1 Even Odd Swapped Register (SHIFTBUFEOS1) */
#define S32K3XX_FLEXIO_SHIFTBUFEOS2_OFFSET   (0x0888) /* Shifter Buffer 2 Even Odd Swapped Register (SHIFTBUFEOS2) */
#define S32K3XX_FLEXIO_SHIFTBUFEOS3_OFFSET   (0x088c) /* Shifter Buffer 3 Even Odd Swapped Register (SHIFTBUFEOS3) */
#define S32K3XX_FLEXIO_SHIFTBUFEOS4_OFFSET   (0x0890) /* Shifter Buffer 4 Even Odd Swapped Register (SHIFTBUFEOS4) */
#define S32K3XX_FLEXIO_SHIFTBUFEOS5_OFFSET   (0x0894) /* Shifter Buffer 5 Even Odd Swapped Register (SHIFTBUFEOS5) */
#define S32K3XX_FLEXIO_SHIFTBUFEOS6_OFFSET   (0x0898) /* Shifter Buffer 6 Even Odd Swapped Register (SHIFTBUFEOS6) */
#define S32K3XX_FLEXIO_SHIFTBUFEOS7_OFFSET   (0x089c) /* Shifter Buffer 7 Even Odd Swapped Register (SHIFTBUFEOS7) */
#define S32K3XX_FLEXIO_SHIFTBUFHBS0_OFFSET   (0x0900) /* Shifter Buffer 0 Halfword Byte Swapped Register (SHIFTBUFHBS0) */
#define S32K3XX_FLEXIO_SHIFTBUFHBS1_OFFSET   (0x0904) /* Shifter Buffer 1 Halfword Byte Swapped Register (SHIFTBUFHBS1) */
#define S32K3XX_FLEXIO_SHIFTBUFHBS2_OFFSET   (0x0908) /* Shifter Buffer 2 Halfword Byte Swapped Register (SHIFTBUFHBS2) */
#define S32K3XX_FLEXIO_SHIFTBUFHBS3_OFFSET   (0x090c) /* Shifter Buffer 3 Halfword Byte Swapped Register (SHIFTBUFHBS3) */
#define S32K3XX_FLEXIO_SHIFTBUFHBS4_OFFSET   (0x0910) /* Shifter Buffer 4 Halfword Byte Swapped Register (SHIFTBUFHBS4) */
#define S32K3XX_FLEXIO_SHIFTBUFHBS5_OFFSET   (0x0914) /* Shifter Buffer 5 Halfword Byte Swapped Register (SHIFTBUFHBS5) */
#define S32K3XX_FLEXIO_SHIFTBUFHBS6_OFFSET   (0x0918) /* Shifter Buffer 6 Halfword Byte Swapped Register (SHIFTBUFHBS6) */
#define S32K3XX_FLEXIO_SHIFTBUFHBS7_OFFSET   (0x091c) /* Shifter Buffer 7 Halfword Byte Swapped Register (SHIFTBUFHBS7) */

#define S32K3XX_FLEXIO_SHIFTCTL_OFFSET(n)    (0x0080 + ((n) << 2)) /* Shifter Control n Register (SHIFTCTLn) */
#define S32K3XX_FLEXIO_SHIFTCFG_OFFSET(n)    (0x0100 + ((n) << 2)) /* Shifter Configuration n Register (SHIFTCFGn) */
#define S32K3XX_FLEXIO_SHIFTBUF_OFFSET(n)    (0x0200 + ((n) << 2)) /* Shifter Buffer n Register (SHIFTBUFn) */
#define S32K3XX_FLEXIO_SHIFTBUFBIS_OFFSET(n) (0x0280 + ((n) << 2)) /* Shifter Buffer n Bit Swapped Register (SHIFTBUFBISn) */
#define S32K3XX_FLEXIO_SHIFTBUFBYS_OFFSET(n) (0x0300 + ((n) << 2)) /* Shifter Buffer n Byte Swapped Register (SHIFTBUFBYSn) */
#define S32K3XX_FLEXIO_SHIFTBUFBBS_OFFSET(n) (0x0380 + ((n) << 2)) /* Shifter Buffer n Bit Byte Swapped Register (SHIFTBUFBBSn) */
#define S32K3XX_FLEXIO_TIMCTL_OFFSET(n)      (0x0400 + ((n) << 2)) /* Timer Control n Register (TIMCTLn) */
#define S32K3XX_FLEXIO_TIMCFG_OFFSET(n)      (0x0480 + ((n) << 2)) /* Timer Configuration n Register (TIMCFGn) */
#define S32K3XX_FLEXIO_TIMCMP_OFFSET(n)      (0x0500 + ((n) << 2)) /* Timer Compare n Register (TIMCMPn) */
#define S32K3XX_FLEXIO_SHIFTBUFNBS_OFFSET(n) (0x0680 + ((n) << 2)) /* Shifter Buffer n Nibble Byte Swapped Register (SHIFTBUFNBSn) */
#define S32K3XX_FLEXIO_SHIFTBUFHWS_OFFSET(n) (0x0700 + ((n) << 2)) /* Shifter Buffer n Half Word Swapped Register (SHIFTBUFHWSn) */
#define S32K3XX_FLEXIO_SHIFTBUFNIS_OFFSET(n) (0x0780 + ((n) << 2)) /* Shifter Buffer n Nibble Swapped Register (SHIFTBUFNISn) */
#define S32K3XX_FLEXIO_SHIFTBUFOES_OFFSET(n) (0x0800 + ((n) << 2)) /* Shifter Buffer n Odd Even Swapped Register (SHIFTBUFOESn) */
#define S32K3XX_FLEXIO_SHIFTBUFEOS_OFFSET(n) (0x0880 + ((n) << 2)) /* Shifter Buffer n Even Odd Swapped Register (SHIFTBUFEOSn) */
#define S32K3XX_FLEXIO_SHIFTBUFHBS_OFFSET(n) (0x0900 + ((n) << 2)) /* Shifter Buffer n Halfword Byte Swapped Register (SHIFTBUFHBSn) */

/* FlexIO Register Addresses ************************************************/

