apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_flexio.h
#define S32K3XX_FLEXIO_VERID                 (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_VERID_OFFSET)
#define S32K3XX_FLEXIO_PARAM                 (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_PARAM_OFFSET)
#define S32K3XX_FLEXIO_CTRL                  (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_CTRL_OFFSET)
#define S32K3XX_FLEXIO_PIN                   (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_PIN_OFFSET)
#define S32K3XX_FLEXIO_SHIFTSTAT             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTSTAT_OFFSET)
#define S32K3XX_FLEXIO_SHIFTERR              (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTERR_OFFSET)
#define S32K3XX_FLEXIO_TIMSTAT               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMSTAT_OFFSET)
#define S32K3XX_FLEXIO_SHIFTSIEN             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTSIEN_OFFSET)
#define S32K3XX_FLEXIO_SHIFTEIEN             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTEIEN_OFFSET)
#define S32K3XX_FLEXIO_TIMIEN                (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMIEN_OFFSET)
#define S32K3XX_FLEXIO_SHIFTSDEN             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTSDEN_OFFSET)
#define S32K3XX_FLEXIO_TIMERSDEN             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMERSDEN_OFFSET)
#define S32K3XX_FLEXIO_SHIFTSTATE            (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTSTATE_OFFSET)
#define S32K3XX_FLEXIO_TRGSTAT               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TRGSTAT_OFFSET)
#define S32K3XX_FLEXIO_TRIGIEN               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TRIGIEN_OFFSET)
#define S32K3XX_FLEXIO_PINSTAT               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_PINSTAT_OFFSET)
#define S32K3XX_FLEXIO_PINIEN                (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_PINIEN_OFFSET)
#define S32K3XX_FLEXIO_PINREN                (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_PINREN_OFFSET)
#define S32K3XX_FLEXIO_PINFEN                (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_PINFEN_OFFSET)
#define S32K3XX_FLEXIO_PINOUTD               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_PINOUTD_OFFSET)
#define S32K3XX_FLEXIO_PINOUTE               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_PINOUTE_OFFSET)
#define S32K3XX_FLEXIO_PINOUTDIS             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_PINOUTDIS_OFFSET)
#define S32K3XX_FLEXIO_PINOUTCLR             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_PINOUTCLR_OFFSET)
#define S32K3XX_FLEXIO_PINOUTSET             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_PINOUTSET_OFFSET)
#define S32K3XX_FLEXIO_PINOUTTOG             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_PINOUTTOG_OFFSET)
#define S32K3XX_FLEXIO_SHIFTCTL0             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTCTL0_OFFSET)
#define S32K3XX_FLEXIO_SHIFTCTL1             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTCTL1_OFFSET)
#define S32K3XX_FLEXIO_SHIFTCTL2             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTCTL2_OFFSET)
#define S32K3XX_FLEXIO_SHIFTCTL3             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTCTL3_OFFSET)
#define S32K3XX_FLEXIO_SHIFTCTL4             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTCTL4_OFFSET)
#define S32K3XX_FLEXIO_SHIFTCTL5             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTCTL5_OFFSET)
#define S32K3XX_FLEXIO_SHIFTCTL6             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTCTL6_OFFSET)
#define S32K3XX_FLEXIO_SHIFTCTL7             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTCTL7_OFFSET)
#define S32K3XX_FLEXIO_SHIFTCFG0             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTCFG0_OFFSET)
#define S32K3XX_FLEXIO_SHIFTCFG1             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTCFG1_OFFSET)
#define S32K3XX_FLEXIO_SHIFTCFG2             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTCFG2_OFFSET)
#define S32K3XX_FLEXIO_SHIFTCFG3             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTCFG3_OFFSET)
#define S32K3XX_FLEXIO_SHIFTCFG4             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTCFG4_OFFSET)
#define S32K3XX_FLEXIO_SHIFTCFG5             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTCFG5_OFFSET)
#define S32K3XX_FLEXIO_SHIFTCFG6             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTCFG6_OFFSET)
#define S32K3XX_FLEXIO_SHIFTCFG7             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTCFG7_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUF0             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUF0_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUF1             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUF1_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUF2             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUF2_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUF3             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUF3_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUF4             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUF4_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUF5             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUF5_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUF6             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUF6_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUF7             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUF7_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFBIS0          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBIS0_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFBIS1          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBIS1_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFBIS2          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBIS2_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFBIS3          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBIS3_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFBIS4          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBIS4_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFBIS5          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBIS5_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFBIS6          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBIS6_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFBIS7          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBIS7_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFBYS0          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBYS0_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFBYS1          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBYS1_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFBYS2          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBYS2_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFBYS3          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBYS3_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFBYS4          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBYS4_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFBYS5          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBYS5_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFBYS6          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBYS6_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFBYS7          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBYS7_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFBBS0          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBBS0_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFBBS1          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBBS1_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFBBS2          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBBS2_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFBBS3          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBBS3_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFBBS4          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBBS4_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFBBS5          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBBS5_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFBBS6          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBBS6_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFBBS7          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBBS7_OFFSET)
#define S32K3XX_FLEXIO_TIMCTL0               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCTL0_OFFSET)
#define S32K3XX_FLEXIO_TIMCTL1               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCTL1_OFFSET)
#define S32K3XX_FLEXIO_TIMCTL2               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCTL2_OFFSET)
#define S32K3XX_FLEXIO_TIMCTL3               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCTL3_OFFSET)
#define S32K3XX_FLEXIO_TIMCTL4               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCTL4_OFFSET)
#define S32K3XX_FLEXIO_TIMCTL5               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCTL5_OFFSET)
#define S32K3XX_FLEXIO_TIMCTL6               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCTL6_OFFSET)
#define S32K3XX_FLEXIO_TIMCTL7               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCTL7_OFFSET)
#define S32K3XX_FLEXIO_TIMCFG0               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCFG0_OFFSET)
#define S32K3XX_FLEXIO_TIMCFG1               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCFG1_OFFSET)
#define S32K3XX_FLEXIO_TIMCFG2               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCFG2_OFFSET)
#define S32K3XX_FLEXIO_TIMCFG3               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCFG3_OFFSET)
#define S32K3XX_FLEXIO_TIMCFG4               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCFG4_OFFSET)
#define S32K3XX_FLEXIO_TIMCFG5               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCFG5_OFFSET)
#define S32K3XX_FLEXIO_TIMCFG6               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCFG6_OFFSET)
#define S32K3XX_FLEXIO_TIMCFG7               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCFG7_OFFSET)
#define S32K3XX_FLEXIO_TIMCMP0               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCMP0_OFFSET)
#define S32K3XX_FLEXIO_TIMCMP1               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCMP1_OFFSET)
#define S32K3XX_FLEXIO_TIMCMP2               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCMP2_OFFSET)
#define S32K3XX_FLEXIO_TIMCMP3               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCMP3_OFFSET)
#define S32K3XX_FLEXIO_TIMCMP4               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCMP4_OFFSET)
#define S32K3XX_FLEXIO_TIMCMP5               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCMP5_OFFSET)
#define S32K3XX_FLEXIO_TIMCMP6               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCMP6_OFFSET)
#define S32K3XX_FLEXIO_TIMCMP7               (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCMP7_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFNBS0          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFNBS0_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFNBS1          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFNBS1_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFNBS2          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFNBS2_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFNBS3          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFNBS3_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFNBS4          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFNBS4_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFNBS5          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFNBS5_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFNBS6          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFNBS6_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFNBS7          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFNBS7_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFHWS0          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFHWS0_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFHWS1          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFHWS1_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFHWS2          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFHWS2_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFHWS3          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFHWS3_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFHWS4          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFHWS4_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFHWS5          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFHWS5_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFHWS6          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFHWS6_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFHWS7          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFHWS7_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFNIS0          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFNIS0_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFNIS1          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFNIS1_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFNIS2          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFNIS2_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFNIS3          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFNIS3_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFNIS4          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFNIS4_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFNIS5          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFNIS5_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFNIS6          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFNIS6_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFNIS7          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFNIS7_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFOES0          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFOES0_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFOES1          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFOES1_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFOES2          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFOES2_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFOES3          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFOES3_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFOES4          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFOES4_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFOES5          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFOES5_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFOES6          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFOES6_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFOES7          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFOES7_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFEOS0          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFEOS0_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFEOS1          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFEOS1_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFEOS2          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFEOS2_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFEOS3          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFEOS3_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFEOS4          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFEOS4_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFEOS5          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFEOS5_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFEOS6          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFEOS6_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFEOS7          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFEOS7_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFHBS0          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFHBS0_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFHBS1          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFHBS1_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFHBS2          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFHBS2_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFHBS3          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFHBS3_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFHBS4          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFHBS4_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFHBS5          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFHBS5_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFHBS6          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFHBS6_OFFSET)
#define S32K3XX_FLEXIO_SHIFTBUFHBS7          (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFHBS7_OFFSET)

#define S32K3XX_FLEXIO_SHIFTCTL(n)           (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTCTL_OFFSET(n))
#define S32K3XX_FLEXIO_SHIFTCFG(n)           (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTCFG_OFFSET(n))
#define S32K3XX_FLEXIO_SHIFTBUF(n)           (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUF_OFFSET(n))
#define S32K3XX_FLEXIO_SHIFTBUFBIS(n)        (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBIS_OFFSET(n))
#define S32K3XX_FLEXIO_SHIFTBUFBYS(n)        (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBYS_OFFSET(n))
#define S32K3XX_FLEXIO_SHIFTBUFBBS(n)        (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFBBS_OFFSET(n))
#define S32K3XX_FLEXIO_TIMCTL(n)             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCTL_OFFSET(n))
#define S32K3XX_FLEXIO_TIMCFG(n)             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCFG_OFFSET(n))
#define S32K3XX_FLEXIO_TIMCMP(n)             (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_TIMCMP_OFFSET(n))
#define S32K3XX_FLEXIO_SHIFTBUFNBS(n)        (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFNBS_OFFSET(n))
#define S32K3XX_FLEXIO_SHIFTBUFHWS(n)        (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFHWS_OFFSET(n))
#define S32K3XX_FLEXIO_SHIFTBUFNIS(n)        (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFNIS_OFFSET(n))
#define S32K3XX_FLEXIO_SHIFTBUFOES(n)        (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFOES_OFFSET(n))
#define S32K3XX_FLEXIO_SHIFTBUFEOS(n)        (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFEOS_OFFSET(n))
#define S32K3XX_FLEXIO_SHIFTBUFHBS(n)        (S32K3XX_FLEXIO_BASE + S32K3XX_FLEXIO_SHIFTBUFHBS_OFFSET(n))

/* Register Bit Definitions *************************************************/

/* Version ID Register (VERID) */

#define FLEXIO_VERID_FEATURE_SHIFT        (0)       /* Bits 0-15: Feature Specification Number (FEATURE) */
#define FLEXIO_VERID_FEATURE_MASK         (0xffff << FLEXIO_VERID_FEATURE_SHIFT)
#define FLEXIO_VERID_MINOR_SHIFT          (16)      /* Bits 16-23: Minor Version Number (MINOR) */
#define FLEXIO_VERID_MINOR_MASK           (0xff << FLEXIO_VERID_MINOR_SHIFT)
#define FLEXIO_VERID_MAJOR_SHIFT          (24)      /* Bits 24-31: Major Version Number (MAJOR) */
#define FLEXIO_VERID_MAJOR_MASK           (0xff << FLEXIO_VERID_MAJOR_SHIFT)

/* Parameter Register (PARAM) */

#define FLEXIO_PARAM_SHIFTER_SHIFT        (0)       /* Bits 0-7: Shifter Number (SHIFTER) */
#define FLEXIO_PARAM_SHIFTER_MASK         (0xff << FLEXIO_PARAM_SHIFTER_SHIFT)
#define FLEXIO_PARAM_TIMER_SHIFT          (8)       /* Bits 8-15: Timer Number (TIMER) */
#define FLEXIO_PARAM_TIMER_MASK           (0xff << FLEXIO_PARAM_TIMER_SHIFT)
#define FLEXIO_PARAM_PIN_SHIFT            (16)      /* Bits 16-23: Pin Number (PIN) */
#define FLEXIO_PARAM_PIN_MASK             (0xff << FLEXIO_PARAM_PIN_SHIFT)
#define FLEXIO_PARAM_TRIGGER_SHIFT        (24)      /* Bits 24-31: Trigger Number (TRIGGER) */
#define FLEXIO_PARAM_TRIGGER_MASK         (0xff << FLEXIO_PARAM_TRIGGER_SHIFT)

/* FlexIO Control Register (CTRL) */

#define FLEXIO_CTRL_FLEXEN                (1 << 0)  /* Bit 0: FlexIO Enable (FLEXEN) */
#  define FLEXIO_CTRL_FLEXEN_DIS          (0 << 0)  /*        FlexIO module is disabled */
#  define FLEXIO_CTRL_FLEXEN_ENA          (1 << 0)  /*        FlexIO module is enabled */
#define FLEXIO_CTRL_SWRST                 (1 << 1)  /* Bit 1: Software Reset (SWRST) */
#  define FLEXIO_CTRL_SWRST_DIS           (0 << 1)  /*        Software reset is disabled */
#  define FLEXIO_CTRL_SWRST_ENA           (1 << 1)  /*        Software reset is enabled */
#define FLEXIO_CTRL_FASTACC               (1 << 2)  /* Bit 2: Fast Access (FASTACC) */
#  define FLEXIO_CTRL_FASTACC_NORMAL      (0 << 2)  /*        Configures for normal register accesses to FlexIO */
#  define FLEXIO_CTRL_FASTACC_FAST        (1 << 2)  /*        Configures for fast register accesses to FlexIO */
                                                    /* Bits 3-29: Reserved */
#define FLEXIO_CTRL_DBGE                  (1 << 30) /* Bit 30: Debug Enable (DBGE) */
#  define FLEXIO_CTRL_DBGE_DIS            (0 << 30) /*         FlexIO is disabled in debug modes */
#  define FLEXIO_CTRL_DBGE_ENA            (1 << 30) /*         FlexIO is enabled in debug modes */
                                                    /* Bit 31: Reserved */

/* Pin State Register (PIN) */

#define FLEXIO_PIN_PDI_SHIFT              (0)       /* Bits 0-31: Pin Data Input (PDI) */
#define FLEXIO_PIN_PDI_MASK               (0xffffffff << FLEXIO_PIN_PDI_SHIFT)

/* Shifter Status Register (SHIFTSTAT) */

#define FLEXIO_SHIFTSTAT_SSF_SHIFT        (0)       /* Bits 0-7: Shifter Status Flag (SSF) */
#define FLEXIO_SHIFTSTAT_SSF_MASK         (0xff << FLEXIO_SHIFTSTAT_SSF_SHIFT)
                                                    /* Bits 8-31: Reserved */

/* Shifter Error Register (SHIFTERR) */

#define FLEXIO_SHIFTERR_SEF_SHIFT         (0)       /* Bits 0-7: Shifter Error Flags (SEF) */
#define FLEXIO_SHIFTERR_SEF_MASK          (0xff << FLEXIO_SHIFTERR_SEF_SHIFT)
                                                    /* Bits 8-31: Reserved */

/* Timer Status Register (TIMSTAT) */

#define FLEXIO_TIMSTAT_TSF_SHIFT          (0)       /* Bits 0-7: Timer Status Flags (TSF) */
#define FLEXIO_TIMSTAT_TSF_MASK           (0xff << FLEXIO_TIMSTAT_TSF_SHIFT)
                                                    /* Bits 8-31: Reserved */

/* Shifter Status Interrupt Enable (SHIFTSIEN) */

#define FLEXIO_SHIFTSIEN_SSIE_SHIFT       (0)       /* Bits 0-7: Shifter Status Interrupt Enable (SSIE) */
#define FLEXIO_SHIFTSIEN_SSIE_MASK        (0xff << FLEXIO_SHIFTSIEN_SSIE_SHIFT)
                                                    /* Bits 8-31: Reserved */

