apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_flexio.h
/* Shifter Error Interrupt Enable (SHIFTEIEN) */

#define FLEXIO_SHIFTEIEN_SEIE_SHIFT       (0)       /* Bits 0-7: Shifter Error Interrupt Enable (SEIE) */
#define FLEXIO_SHIFTEIEN_SEIE_MASK        (0xff << FLEXIO_SHIFTEIEN_SEIE_SHIFT)
                                                    /* Bits 8-31: Reserved */

/* Timer Interrupt Enable Register (TIMIEN) */

#define FLEXIO_TIMIEN_TEIE_SHIFT          (0)       /* Bits 0-7: Timer Status Interrupt Enable (TEIE) */
#define FLEXIO_TIMIEN_TEIE_MASK           (0xff << FLEXIO_TIMIEN_TEIE_SHIFT)
                                                    /* Bits 8-31: Reserved */

/* Shifter Status DMA Enable (SHIFTSDEN) */

#define FLEXIO_SHIFTSDEN_SSDE_SHIFT       (0)       /* Bits 0-7: Shifter Status DMA Enable (SSDE) */
#define FLEXIO_SHIFTSDEN_SSDE_MASK        (0xff << FLEXIO_SHIFTSDEN_SSDE_SHIFT)
                                                    /* Bits 8-31: Reserved */

/* Timer Status DMA Enable (TIMERSDEN) */

#define FLEXIO_TIMERSDEN_TSDE_SHIFT       (0)       /* Bits 0-7: Timer Status DMA Enable (TSDE) */
#define FLEXIO_TIMERSDEN_TSDE_MASK        (0xff << FLEXIO_TIMERSDEN_TSDE_SHIFT)
                                                    /* Bits 8-31: Reserved */

/* Shifter State Register (SHIFTSTATE) */

#define FLEXIO_SHIFTSTATE_STATE_SHIFT     (0)       /* Bits 0-2: Current State Pointer (STATE) */
#define FLEXIO_SHIFTSTATE_STATE_MASK      (0x07 << FLEXIO_SHIFTSTATE_STATE_SHIFT)
                                                    /* Bits 3-31: Reserved */

/* Trigger Status Register (TRGSTAT) */

#define FLEXIO_TRGSTAT_ETSF_SHIFT         (0)       /* Bits 0-3: External Trigger Status Flags (ETSF) */
#define FLEXIO_TRGSTAT_ETSF_MASK          (0x0f << FLEXIO_TRGSTAT_ETSF_SHIFT)
                                                    /* Bits 4-31: Reserved */

/* External Trigger Interrupt Enable Register (TRIGIEN) */

#define FLEXIO_TRIGIEN_TRIE_SHIFT         (0)       /* Bits 0-3: External Trigger Interrupt Enable (TRIE) */
#define FLEXIO_TRIGIEN_TRIE_MASK          (0x0f << FLEXIO_TRIGIEN_TRIE_SHIFT)
                                                    /* Bits 4-31: Reserved */

/* Pin Status Register (PINSTAT) */

#define FLEXIO_PINSTAT_PSF_SHIFT          (0)       /* Bits 0-31: Pin Status Flags (PSF) */
#define FLEXIO_PINSTAT_PSF_MASK           (0xffffffff << FLEXIO_PINSTAT_PSF_SHIFT)

/* Pin Interrupt Enable Register (PINIEN) */

#define FLEXIO_PINIEN_PSIE_SHIFT          (0)       /* Bits 0-31: Pin Status Interrupt Enable (PSIE) */
#define FLEXIO_PINIEN_PSIE_MASK           (0xffffffff << FLEXIO_PINIEN_PSIE_SHIFT)

/* Pin Rising Edge Enable Register (PINREN) */

#define FLEXIO_PINREN_PRE_SHIFT           (0)       /* Bits 0-31: Pin Rising Edge (PRE) */
#define FLEXIO_PINREN_PRE_MASK            (0xffffffff << FLEXIO_PINREN_PRE_SHIFT)

/* Pin Falling Edge Enable Register (PINFEN) */

#define FLEXIO_PINFEN_PFE_SHIFT           (0)       /* Bits 0-31: Pin Falling Edge (PFE) */
#define FLEXIO_PINFEN_PFE_MASK            (0xffffffff << FLEXIO_PINFEN_PFE_SHIFT)

/* Pin Output Data Register (PINOUTD) */

#define FLEXIO_PINOUTD_OUTD_SHIFT         (0)       /* Bits 0-31: Output Data (OUTD) */
#define FLEXIO_PINOUTD_OUTD_MASK          (0xffffffff << FLEXIO_PINOUTD_OUTD_SHIFT)

/* Pin Output Enable Register (PINOUTE) */

#define FLEXIO_PINOUTE_OUTE_SHIFT         (0)       /* Bits 0-31: Output Enable (OUTE) */
#define FLEXIO_PINOUTE_OUTE_MASK          (0xffffffff << FLEXIO_PINOUTE_OUTE_SHIFT)

/* Pin Output Disable Register (PINOUTDIS) */

#define FLEXIO_PINOUTDIS_OUTDIS_SHIFT     (0)       /* Bits 0-31: Output Disable (OUTDIS) */
#define FLEXIO_PINOUTDIS_OUTDIS_MASK      (0xffffffff << FLEXIO_PINOUTDIS_OUTDIS_SHIFT)

/* Pin Output Clear Register (PINOUTCLR) */

#define FLEXIO_PINOUTCLR_OUTCLR_SHIFT     (0)       /* Bits 0-31: Output Clear (OUTCLR) */
#define FLEXIO_PINOUTCLR_OUTCLR_MASK      (0xffffffff << FLEXIO_PINOUTCLR_OUTCLR_SHIFT)

/* Pin Output Set Register (PINOUTSET) */

#define FLEXIO_PINOUTSET_OUTSET_SHIFT     (0)       /* Bits 0-31: Output Set (OUTSET) */
#define FLEXIO_PINOUTSET_OUTSET_MASK      (0xffffffff << FLEXIO_PINOUTSET_OUTSET_SHIFT)

/* Pin Output Toggle Register (PINOUTTOG) */

#define FLEXIO_PINOUTTOG_OUTTOG_SHIFT     (0)       /* Bits 0-31: Output Toggle (OUTTOG) */
#define FLEXIO_PINOUTTOG_OUTTOG_MASK      (0xffffffff << FLEXIO_PINOUTTOG_OUTTOG_SHIFT)

/* Shifter Control n Register (SHIFTCTLn) */

#define FLEXIO_SHIFTCTL_SMOD_SHIFT        (0)       /* Bits 0-2: Shifter Mode (SMOD) */
#define FLEXIO_SHIFTCTL_SMOD_MASK         (0x07 << FLEXIO_SHIFTCTL_SMOD_SHIFT)
#  define FLEXIO_SHIFTCTL_SMOD_DIS        (0x00 << FLEXIO_SHIFTCTL_SMOD_SHIFT) /* Disabled */
#  define FLEXIO_SHIFTCTL_SMOD_RX         (0x01 << FLEXIO_SHIFTCTL_SMOD_SHIFT) /* Receive mode */
#  define FLEXIO_SHIFTCTL_SMOD_TX         (0x02 << FLEXIO_SHIFTCTL_SMOD_SHIFT) /* Transmit mode */
#  define FLEXIO_SHIFTCTL_SMOD_STORE      (0x04 << FLEXIO_SHIFTCTL_SMOD_SHIFT) /* Match Store mode */
#  define FLEXIO_SHIFTCTL_SMOD_CONT       (0x05 << FLEXIO_SHIFTCTL_SMOD_SHIFT) /* Match Continuous mode */
#  define FLEXIO_SHIFTCTL_SMOD_STATE      (0x06 << FLEXIO_SHIFTCTL_SMOD_SHIFT) /* State mode */
#  define FLEXIO_SHIFTCTL_SMOD_LOGIC      (0x07 << FLEXIO_SHIFTCTL_SMOD_SHIFT) /* Logic mode */

                                                    /* Bits 3-6: Reserved */
#define FLEXIO_SHIFTCTL_PINPOL            (1 << 7)  /* Bit 7: Shifter Pin Polarity (PINPOL) */
#  define FLEXIO_SHIFTCTL_PINPOL_HI       (0 << 7)  /*        Pin is active high */
#  define FLEXIO_SHIFTCTL_PINPOL_LO       (1 << 7)  /*        Pin is active low */
#define FLEXIO_SHIFTCTL_PINSEL_SHIFT      (8)       /* Bits 8-12: Shifter Pin Select (PINSEL) */
#define FLEXIO_SHIFTCTL_PINSEL_MASK       (0x1f << FLEXIO_SHIFTCTL_PINSEL_SHIFT)
#  define FLEXIO_SHIFTCTL_PINSEL(n)       (((n) << FLEXIO_SHIFTCTL_PINSEL_SHIFT) & FLEXIO_SHIFTCTL_PINSEL_MASK)
                                                    /* Bits 13-15: Reserved */
#define FLEXIO_SHIFTCTL_PINCFG_SHIFT      (16)      /* Bits 16-17: Shifter Pin Configuration (PINCFG) */
#define FLEXIO_SHIFTCTL_PINCFG_MASK       (0x03 << FLEXIO_SHIFTCTL_PINCFG_SHIFT)
#  define FLEXIO_SHIFTCTL_PINCFG_DIS      (0x00 << FLEXIO_SHIFTCTL_PINCFG_SHIFT) /* Shifter pin output disabled */
#  define FLEXIO_SHIFTCTL_PINCFG_OD       (0x01 << FLEXIO_SHIFTCTL_PINCFG_SHIFT) /* Shifter pin open drain or bidirectional output enable */
#  define FLEXIO_SHIFTCTL_PINCFG_BID      (0x02 << FLEXIO_SHIFTCTL_PINCFG_SHIFT) /* Shifter pin bidirectional output data */
#  define FLEXIO_SHIFTCTL_PINCFG_OUT      (0x03 << FLEXIO_SHIFTCTL_PINCFG_SHIFT) /* Shifter pin output */

