apache/nuttx/arch/arm/src/s32k3xx/hardware/s32k3xx_flexio.h
                                                    /* Bit 23: Reserved */
#define FLEXIO_TIMCFG_TIMOUT_SHIFT        (24)      /* Bits 24-25: Timer Output (TIMOUT) */ 
#define FLEXIO_TIMCFG_TIMOUT_MASK         (0x03 << FLEXIO_TIMCFG_TIMOUT_SHIFT)
#  define FLEXIO_TIMCFG_TIMOUT_ONE        (0x00 << FLEXIO_TIMCFG_TIMOUT_SHIFT) /* Timer output is logic one when enabled and is not affected by timer reset */
#  define FLEXIO_TIMCFG_TIMOUT_ZERO       (0x01 << FLEXIO_TIMCFG_TIMOUT_SHIFT) /* Timer output is logic zero when enabled and is not affected by timer reset */
#  define FLEXIO_TIMCFG_TIMOUT_ONERST     (0x02 << FLEXIO_TIMCFG_TIMOUT_SHIFT) /* Timer output is logic one when enabled and on timer reset */
#  define FLEXIO_TIMCFG_TIMOUT_ZERORST    (0x03 << FLEXIO_TIMCFG_TIMOUT_SHIFT) /* Timer output is logic zero when enabled and on timer reset */

                                                    /* Bits 26-31: Reserved */

/* Timer Compare n Register (TIMCMPn) */

#define FLEXIO_TIMCMP_CMP_SHIFT           (0)       /* Bits 0-15: Timer Compare Value (CMP) */
#define FLEXIO_TIMCMP_CMP_MASK            (0xffff << FLEXIO_TIMCMP_CMP_SHIFT)
                                                    /* Bits 16-31: Reserved */

/* Shifter Buffer n Nibble Byte Swapped Register (SHIFTBUFNBSn) */

#define FLEXIO_SHIFTBUFNBS_SHIFT          (0)       /* Bits 0-31: Shift Buffer (nibble swapped within each byte) (SHIFTBUFNBS) */
#define FLEXIO_SHIFTBUFNBS_MASK           (0xffffffff << FLEXIO_SHIFTBUFNBS_SHIFT)

/* Shifter Buffer n Half Word Swapped Register (SHIFTBUFHWSn) */

#define FLEXIO_SHIFTBUFHWS_SHIFT          (0)       /* Bits 0-31: Shift Buffer (half word swapped) (SHIFTBUFHWS) */
#define FLEXIO_SHIFTBUFHWS_MASK           (0xffffffff << FLEXIO_SHIFTBUFHWS_SHIFT)

/* Shifter Buffer n Nibble Swapped Register (SHIFTBUFNISn) */

#define FLEXIO_SHIFTBUFNIS_SHIFT          (0)       /* Bits 0-31: Shift Buffer (nibble swapped) (SHIFTBUFNIS) */
#define FLEXIO_SHIFTBUFNIS_MASK           (0xffffffff << FLEXIO_SHIFTBUFNIS_SHIFT)

/* Shifter Buffer n Odd Even Swapped Register (SHIFTBUFOESn) */

#define FLEXIO_SHIFTBUFOES_SHIFT          (0)       /* Bits 0-31: Shift Buffer (odd and even bits partitioned) (SHIFTBUFOES) */
#define FLEXIO_SHIFTBUFOES_MASK           (0xffffffff << FLEXIO_SHIFTBUFOES_SHIFT)

/* Shifter Buffer n Even Odd Swapped Register (SHIFTBUFEOSn) */

#define FLEXIO_SHIFTBUFEOS_SHIFT          (0)       /* Bits 0-31: Shift Buffer (even and odd bits partitioned) (SHIFTBUFEOS) */
#define FLEXIO_SHIFTBUFEOS_MASK           (0xffffffff << FLEXIO_SHIFTBUFEOS_SHIFT)

/* Shifter Buffer n Halfword Byte Swapped Register (SHIFTBUFHBSn) */

#define FLEXIO_SHIFTBUFHBS_SHIFT          (0)       /* Bits 0-31: Shift Buffer (halfword byte swapped) (SHIFTBUFHBS) */
#define FLEXIO_SHIFTBUFHBS_MASK           (0xffffffff << FLEXIO_SHIFTBUFHBS_SHIFT)

#endif /* __ARCH_ARM_SRC_S32K3XX_HARDWARE_S32K3XX_FLEXIO_H */
